In [11]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [10]:
data= pd.read_csv('D:\DATASETS\Startups.csv')
data.head()

,Company,Valuation,Valuation_date,Industry,Country
0,ByteDance,140.0,April-21,Internet,China
1,SpaceX,100.0,October-21,Aerospace,United States
2,Stripe,95.0,March-21,Financial services,United States / Ireland
3,Klarna,45.6,June-21,Fintech,Sweden
4,Canva,40.0,September-21,Graphic design,Australia

In [14]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 250 entries, 0 to 249
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Company         250 non-null    object
 1   Valuation       250 non-null    float64
 2   Valuation_date  250 non-null    object
 3   Industry        233 non-null    object
 4   Country         250 non-null    object
dtypes: float64(1), object(4)
memory usage: 9.9+ KB

In [17]:
data.describe().round(2)

       Valuation
count     250.00
mean        7.82
std        13.47
min         2.10
25%         3.00
50%         4.03
75%         7.40
max       140.00